DeviceProcessEvents
| where FileName =~ "bitsadmin.exe"
| where ProcessCommandLine has_all ("/transfer", "http")
| project Timestamp, DeviceId, DeviceName, ReportId, AccountName, ProcessCommandLine, InitiatingProcessFileName

///Many software updates (Chrome, Adobe, etc.) use BITS. Filter out these legitimate installers by their InitiatingProcessParentFileName.
