DeviceProcessEvents
| where FileName =~ "reg.exe"
| where ProcessCommandLine has "save" 
| where ProcessCommandLine has_any ("hklm\\sam", "hklm\\system", "hklm\\security")
| project Timestamp, DeviceId, DeviceName, ReportId, AccountName, ProcessCommandLine, FolderPath, InitiatingProcessFileName

///Filter by InitiatingProcessFileName if a known inventory tool is the parent.
