title: Netsh PortProxy Tunneling
id: 67e8901b-2345-6789-01cd-ef1234567890
status: stable
description: Detects netsh.exe being used to create portproxy rules (v4tov4), a common persistence and tunneling technique used to bypass firewalls.
author: Alex Dumas
date: 2025-12-01
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        Image|endswith: '\netsh.exe'
    selection_cli:
        CommandLine|contains|all:
            - 'interface'
            - 'portproxy'
            - 'add'
            - 'v4tov4'
    condition: selection_img and selection_cli
level: high
tags:
    - attack.command_and_control
    - attack.t1090
